Q1. List any five functions of the pandas library with execution.

1-read_csv(): This function is used to read data from a CSV file into a Pandas DataFrame.
python

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\shanza\OneDrive\Documents\shanza\Data science masters\theory\PANDAS\titanic.csv")

2-describe(): This function generates descriptive statistics of a DataFrame, including measures of central tendency, dispersion, and shape of the distribution.

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

3-head(): This function returns the first n rows of a DataFrame. By default, it returns the first 5 rows.

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

4-iloc(): is a method in the Pandas library that is used for integer-location based indexing. It provides a way to select data from a DataFrame by specifying the numerical indices of rows and columns.

In [6]:
df.iloc[3:7,2:5]

   Pclass                                          Name     Sex
3       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4       3                      Allen, Mr. William Henry    male
5       3                              Moran, Mr. James    male
6       1                       McCarthy, Mr. Timothy J    male

5-loc(): loc is a method in the Pandas library that is used for label-based indexing. It provides a way to select data from a DataFrame by specifying the labels of rows and columns.

In [7]:
df.loc[[3,7],['PassengerId','Name','Pclass']]

   PassengerId                                          Name  Pclass
3            4  Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
7            8                Palsson, Master. Gosta Leonard       3

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
#creating a dataframe
dictt1={'A':['Shanza','Shreya','Shruti'],'B':[67,45,23],'C':['Lucknow','Delhi','Mumbai']}

In [9]:
df1=pd.DataFrame(dictt1,index=[1,3,5])

In [10]:
df1

        A   B        C
1  Shanza  67  Lucknow
3  Shreya  45    Delhi
5  Shruti  23   Mumbai

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [11]:

dict2={'object':['Phone','chocolate','laptop','pen'],'Values':[33,67,88,22]}

In [12]:
df2=pd.DataFrame(dict2)

In [13]:
df2

      object  Values
0      Phone      33
1  chocolate      67
2     laptop      88
3        pen      22

In [14]:
value_column=df2['Values']

In [15]:
sum=value_column.head(3).sum()

In [16]:
sum

188

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
pd.set_option('display.max_colwidth',500) 
text='Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.'
d1=pd.DataFrame({'Text':[text,'i live in lucknow']})

In [18]:
d1

                                                                                                                                                                                                                                                                                       Text
0  Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.
1                                                                                                                                                                                                                                                                         i live in lucknow

In [19]:
d1['word_count']=d1['Text'].apply(lambda x:len(x.split()))

In [20]:
d1

,Text,word_count
0,"Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.",40
1,i live in lucknow,4

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size:
DataFrame.size returns the total number of elements in the DataFrame.
It is calculated by multiplying the number of rows by the number of columns.
The result is a single integer representing the total size of the DataFrame.

DataFrame.shape:
DataFrame.shape returns a tuple representing the dimensions of the DataFrame.
The tuple contains two elements: the number of rows and the number of columns, in that order.
It provides a more detailed breakdown of the DataFrame's structure.

Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, you can use the pd.read_excel() function. This function is part of the pandas library in Python and is specifically designed for reading data from Excel files.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [21]:
df5=pd.DataFrame({'Name':['Shanza','Ritika'],'Email':['shanza12@gmail.com','ritika23@gmail.com']})

In [22]:
def uname(x):
    username=x.split('@')[0]
    return username

In [23]:
df5['username']=df5['Email'].apply(uname)

In [24]:
df5

     Name               Email  username
0  Shanza  shanza12@gmail.com  shanza12
1  Ritika  ritika23@gmail.com  ritika23

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [25]:
d1={'A':[0,1,8,3,14],'B':[3,8,6,2,9],'C':[1,7,4,5,2]}

In [26]:
df3=pd.DataFrame(d1)

In [27]:
df3

    A  B  C
0   0  3  1
1   1  8  7
2   8  6  4
3   3  2  5
4  14  9  2

In [28]:
df3[(df3['A']>5) & (df3['B']<10)]

    A  B  C
2   8  6  4
4  14  9  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [29]:
import statistics

In [30]:
statistics.mean(df2['Values'])

52.5

In [31]:
statistics.median(df2['Values'])

50.0

In [32]:
statistics.stdev(df2['Values'])

30.44667469527666

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [33]:
dt2=pd.date_range(start='2024-01-21',end='2024-01-31')

In [34]:
dt2

DatetimeIndex(['2024-01-21', '2024-01-22', '2024-01-23', '2024-01-24',
               '2024-01-25', '2024-01-26', '2024-01-27', '2024-01-28',
               '2024-01-29', '2024-01-30', '2024-01-31'],
              dtype='datetime64[ns]', freq='D')

In [35]:
sales=[121,232,111,345,543,675,981,234,544,565,999]

In [36]:
dt_df=pd.DataFrame({'Date':dt2,'Sales':sales})

In [37]:
dt_df

         Date  Sales
0  2024-01-21    121
1  2024-01-22    232
2  2024-01-23    111
3  2024-01-24    345
4  2024-01-25    543
5  2024-01-26    675
6  2024-01-27    981
7  2024-01-28    234
8  2024-01-29    544
9  2024-01-30    565
10 2024-01-31    999

In [38]:
dt_df['Movingaverage']=dt_df['Sales'].rolling(window=7,min_periods=1).mean()

In [39]:
dt_df

         Date  Sales  Movingaverage
0  2024-01-21    121     121.000000
1  2024-01-22    232     176.500000
2  2024-01-23    111     154.666667
3  2024-01-24    345     202.250000
4  2024-01-25    543     270.400000
5  2024-01-26    675     337.833333
6  2024-01-27    981     429.714286
7  2024-01-28    234     445.857143
8  2024-01-29    544     490.428571
9  2024-01-30    565     555.285714
10 2024-01-31    999     648.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [40]:
dt=pd.date_range(start='2024-01-21',end='2024-01-31')

In [41]:
dt1=pd.DataFrame({'Date':dt})

In [42]:
dt1

         Date
0  2024-01-21
1  2024-01-22
2  2024-01-23
3  2024-01-24
4  2024-01-25
5  2024-01-26
6  2024-01-27
7  2024-01-28
8  2024-01-29
9  2024-01-30
10 2024-01-31

In [43]:
dt1['Weekday']=dt1['Date'].dt.day_name()

In [44]:
dt1

         Date    Weekday
0  2024-01-21     Sunday
1  2024-01-22     Monday
2  2024-01-23    Tuesday
3  2024-01-24  Wednesday
4  2024-01-25   Thursday
5  2024-01-26     Friday
6  2024-01-27   Saturday
7  2024-01-28     Sunday
8  2024-01-29     Monday
9  2024-01-30    Tuesday
10 2024-01-31  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [65]:
d=pd.date_range(start='2022-12-01',end='2023-02-28')

In [66]:
date1=pd.DataFrame({'Date':d})

In [59]:
#date1

In [67]:
date2=pd.to_datetime(date1['Date'])

In [68]:
date2

0    2022-12-01
1    2022-12-02
2    2022-12-03
3    2022-12-04
4    2022-12-05
        ...
85   2023-02-24
86   2023-02-25
87   2023-02-26
88   2023-02-27
89   2023-02-28
Name: Date, Length: 90, dtype: datetime64[ns]

In [69]:
filtered_df = date1[(date1['Date'] >='2023-01-01' ) & (date1['Date'] <= '2023-01-31')]

In [85]:
filtered_df

         Date
31 2023-01-01
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30
61 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?


To use the basic functions of pandas, the first and foremost library that needs to be imported is, unsurprisingly, the pandas library itself. You typically import pandas with the alias pd, which is a commonly used convention in the Python data science community. Here's an example:

In [ ]:
import pandas as pd

After importing pandas, you can then use its various functions and classes for data manipulation and analysis. It's common to see code examples where pandas is imported at the beginning of a script or notebook before any pandas-related operations are performed.